workstation/openfoam-master-tutorials/tutorials/heatTransfer/overBuoyantPimpleDyMFoam/movingBox/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    ( -2.00  0.0  0)
    ( 107.00  0.0  0)
    ( 107.00  45.0  0)
    ( -2.00  45.0  0)
    ( -2.00  0.0  10)
    ( 107.00  0.0  10)
    ( 107.00  45.0  10)
    ( -2.00  45.0  10)

    // movingZone1
    ( 44.5  5.0  0)
    ( 60.5  5.0  0)
    ( 60.5  40.0  0)
    ( 44.5  40.0  0)
    ( 44.5  5.0  10)
    ( 60.5  5.0  10)
    ( 60.5  40.0  10)
    ( 44.5  40.0  10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (109 55 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) movingZone1 (16 48 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    overset1
    {
        type        overset;
        faces
        (
            ( 8 12 15 11)
            (10 14 13  9)
            (11 15 14 10)
            ( 9 13 12  8)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    inlet
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    // Populated by subsetMesh
    hole
    {
        type wall;
        faces ();
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }

    frontAndBack1
    {
        type empty;
        faces
        (
            ( 8 11 10  9)
            (12 13 14 15)
        );
    }
);


// ************************************************************************* //
